#+TITLE: hierarchical-spectral-clustering
#+AUTHOR: Gregory W. Schwartz

See [[https://github.com/GregorySchwartz/hierarchical-spectral-clustering]] for
latest version.

* Example usage

We first need our data in the format of "vertex,vertex,value", such that a
vertex "x" connects with vertex "y" with an edge weight of value. This edge list
can be used as input into the program. *Make sure there is a newline at the
end*, otherwise, the program may expect more from =stdin=.

#+NAME: exampleEdgeList
#+BEGIN_EXAMPLE
a,b,1
a,c,2
a,d,4.5
b,d,2.1
c,d,1.1
e,f,1
#+END_EXAMPLE

Then we can give this file to the program:

#+HEADER: :var input=exampleEdgeList
#+HEADER: :exports both
#+BEGIN_SRC sh
cat input.csv | cluster-tree --clustering-type Dense
#+END_SRC

#+RESULTS:
| item | cluster |
| a    |       1 |
| b    |       1 |
| c    |       1 |
| d    |       1 |
| e    |       2 |
| f    |       2 |

As a more advanced example, we can get:

- Output clustering
- Output tree structure in =JSON= format.
- First isolate each connected component before clustering and generating their
  own trees.
- Use k-means instead of sign on the eigenvectors to determine cluster assignment.
- Use k-means on two eigenvectors rather than one.

#+BEGIN_SRC sh
cat advanced_input.csv | cluster-tree --output-tree "output_trees/tree.json" --clustering-type Dense --eigen-group KMeansGroup --num-eigen 2 --separate-components > "clusters.csv"
#+END_SRC

